<?php
/**
 * налаштування для роботи megalog
 *
 */

return [

    /* налаштування для роботи email монітора завантажень
    */
    // -- перелік id автостанцій по яких ведеться моніторинг
    'ac' => [1,2,3],
    // -- перелік типів завантажень які моніторяться
    'category' => ['ftp', 'upload', 'free', 'reg'],
    // -- email for sending alerts
    'email_alert' => 'yura.voldiner@gmail.com',
    // -- не повідомляти про відновлення процесів, старших за (днів)
    'day_success_email' => 5,
    // -- відправляти СМС (через турбоСМС) про відсутність синхронізації необхідно прописати параметри додатково в файлі config\turbosms.php
    'sendSMS' => false,
    // -- відправляти СМС (через турбоСМС) про старт скрипта синхронізації необхідно прописати параметри додатково в файлі config\turbosms.php
    'sendSmsStart' => true,
    // -- телефони для відправки смс
    'phones' => [
        '+380508064855'
    ],
    // -- параметри для ведення моніторингу по видах завантажень
    'ftp' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 7,
        'hour_finish' => 20,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 1,
    ],
    'upload' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 1,
        'hour_finish' => 24,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 25,
    ],
    'free' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 7,
        'hour_finish' => 20,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 2,
    ],
    'reg' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 8,
        'hour_finish' => 9,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 25,
    ],
];

