<?php
/**
 * налаштування для роботи megalog
 *
 */

return [

    /* налаштування для роботи email монітора завантажень
    */
    // -- перелік id автостанцій по яких ведеться моніторинг
    'ac' => [1],
    // -- параметри для ведення моніторингу по видах завантажень
    'ftp' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 7,
        'hour_finish' => 20,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 1,
    ],
    'upload' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 9,
        'hour_finish' => 10,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 25,
    ],
    'free' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 7,
        'hour_finish' => 20,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 2,
    ],
    'reg' => [
        // -- години протягом яких ведеться моніторинг
        'hour_start' => 11,
        'hour_finish' => 12,
        // -- кількість годин відсутності завантажень коли
        // -- висилається попередження
        'alert_hours' => 25,
    ],
];

